mdepx/mdepx/arch/arm/raspberrypi/rp2040_pio_regs.h
/****************************************************************************
 * arch/arm/src/rp2040/hardware/rp2040_pio.h
 *
 * Generated from rp2040.svd originally provided by
 *   Raspberry Pi (Trading) Ltd.
 *
 * Copyright 2020 (c) 2020 Raspberry Pi (Trading) Ltd.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name of the copyright holder nor the names of its
 *    contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************/

#ifndef _ARCH_ARM_RASPBERRYPI_RP2040_PIOREGS_H_
#define _ARCH_ARM_RASPBERRYPI_RP2040_PIOREGS_H_

#define RP2040_PIO_CTRL_OFFSET               0x000000                /* PIO control register */
#define RP2040_PIO_FSTAT_OFFSET              0x000004                /* FIFO status register */
#define RP2040_PIO_FDEBUG_OFFSET             0x000008                /* FIFO debug register */
#define RP2040_PIO_FLEVEL_OFFSET             0x00000c                /* FIFO levels */
#define RP2040_PIO_TXF_OFFSET(m)             (0x000010 + (m) * 4)    /* Direct write access to the TX FIFO for this state machine. Each write pushes one word to the FIFO. */
#define RP2040_PIO_RXF_OFFSET(m)             (0x000020 + (m) * 4)    /* Direct read access to the RX FIFO for this state machine. Each read pops one word from the FIFO. */
#define RP2040_PIO_IRQ_OFFSET                0x000030                /* Interrupt request register. Write 1 to clear */
#define RP2040_PIO_IRQ_FORCE_OFFSET          0x000034                /* Writing a 1 to each of these bits will forcibly assert the corresponding IRQ. Note this is different to the INTF register: writing here affects PIO internal state. INTF just asserts the processor-facing IRQ signal for testing ISRs, and is not visible to the state machines. */
#define RP2040_PIO_INPUT_SYNC_BYPASS_OFFSET  0x000038                /* There is a 2-flipflop synchronizer on each GPIO input, which protects PIO logic from metastabilities. This increases input delay, and for fast synchronous IO (e.g. SPI) these synchronizers may need to be bypassed. Each bit in this register corresponds to one GPIO. 0 -> input is synchronized (default) 1 -> synchronizer is bypassed If in doubt, leave this register as all zeroes. */
#define RP2040_PIO_DBG_PADOUT_OFFSET         0x00003c                /* Read to sample the pad output values PIO is currently driving to the GPIOs. */
#define RP2040_PIO_DBG_PADOE_OFFSET          0x000040                /* Read to sample the pad output enables (direction) PIO is currently driving to the GPIOs. */
#define RP2040_PIO_DBG_CFGINFO_OFFSET        0x000044                /* The PIO hardware has some free parameters that may vary between chip products. These should be provided in the chip datasheet, but are also exposed here. */
#define RP2040_PIO_INSTR_MEM_OFFSET(m)       (0x000048 + (m) * 4)    /* Write-only access to instruction memory location m */
#define RP2040_PIO_SM_CLKDIV_OFFSET(m)       (0x0000c8 + (m) * 0x18) /* Clock divider register for state machine 0 Frequency = clock freq / (CLKDIV_INT + CLKDIV_FRAC / 256) */
#define RP2040_PIO_SM_EXECCTRL_OFFSET(m)     (0x0000cc + (m) * 0x18) /* Execution/behavioural settings for state machine 0 */
#define RP2040_PIO_SM_SHIFTCTRL_OFFSET(m)    (0x0000d0 + (m) * 0x18) /* Control behaviour of the input/output shift registers for state machine 0 */
#define RP2040_PIO_SM_ADDR_OFFSET(m)         (0x0000d4 + (m) * 0x18) /* Current instruction address of state machine 0 */
#define RP2040_PIO_SM_INSTR_OFFSET(m)        (0x0000d8 + (m) * 0x18) /* Instruction currently being executed by state machine 0 Write to execute an instruction immediately (including jumps) and then resume execution. */
#define RP2040_PIO_SM_PINCTRL_OFFSET(m)      (0x0000dc + (m) * 0x18) /* State machine pin control */
#define RP2040_PIO_SM0_CLKDIV_OFFSET         0x0000c8                /* Clock divider register for state machine 0 Frequency = clock freq / (CLKDIV_INT + CLKDIV_FRAC / 256) */
#define RP2040_PIO_SM0_EXECCTRL_OFFSET       0x0000cc                /* Execution/behavioural settings for state machine 0 */
#define RP2040_PIO_SM0_SHIFTCTRL_OFFSET      0x0000d0                /* Control behaviour of the input/output shift registers for state machine 0 */
#define RP2040_PIO_SM0_ADDR_OFFSET           0x0000d4                /* Current instruction address of state machine 0 */
#define RP2040_PIO_SM0_INSTR_OFFSET          0x0000d8                /* Instruction currently being executed by state machine 0 Write to execute an instruction immediately (including jumps) and then resume execution. */
#define RP2040_PIO_SM0_PINCTRL_OFFSET        0x0000dc                /* State machine pin control */
#define RP2040_PIO_SM1_CLKDIV_OFFSET         0x0000e0                /* Clock divider register for state machine 1 Frequency = clock freq / (CLKDIV_INT + CLKDIV_FRAC / 256) */
#define RP2040_PIO_SM1_EXECCTRL_OFFSET       0x0000e4                /* Execution/behavioural settings for state machine 1 */
#define RP2040_PIO_SM1_SHIFTCTRL_OFFSET      0x0000e8                /* Control behaviour of the input/output shift registers for state machine 1 */
#define RP2040_PIO_SM1_ADDR_OFFSET           0x0000ec                /* Current instruction address of state machine 1 */
#define RP2040_PIO_SM1_INSTR_OFFSET          0x0000f0                /* Instruction currently being executed by state machine 1 Write to execute an instruction immediately (including jumps) and then resume execution. */
#define RP2040_PIO_SM1_PINCTRL_OFFSET        0x0000f4                /* State machine pin control */
#define RP2040_PIO_SM2_CLKDIV_OFFSET         0x0000f8                /* Clock divider register for state machine 2 Frequency = clock freq / (CLKDIV_INT + CLKDIV_FRAC / 256) */
#define RP2040_PIO_SM2_EXECCTRL_OFFSET       0x0000fc                /* Execution/behavioural settings for state machine 2 */
#define RP2040_PIO_SM2_SHIFTCTRL_OFFSET      0x000100                /* Control behaviour of the input/output shift registers for state machine 2 */
#define RP2040_PIO_SM2_ADDR_OFFSET           0x000104                /* Current instruction address of state machine 2 */
#define RP2040_PIO_SM2_INSTR_OFFSET          0x000108                /* Instruction currently being executed by state machine 2 Write to execute an instruction immediately (including jumps) and then resume execution. */
#define RP2040_PIO_SM2_PINCTRL_OFFSET        0x00010c                /* State machine pin control */
#define RP2040_PIO_SM3_CLKDIV_OFFSET         0x000110                /* Clock divider register for state machine 3 Frequency = clock freq / (CLKDIV_INT + CLKDIV_FRAC / 256) */
#define RP2040_PIO_SM3_EXECCTRL_OFFSET       0x000114                /* Execution/behavioural settings for state machine 3 */
#define RP2040_PIO_SM3_SHIFTCTRL_OFFSET      0x000118                /* Control behaviour of the input/output shift registers for state machine 3 */
#define RP2040_PIO_SM3_ADDR_OFFSET           0x00011c                /* Current instruction address of state machine 3 */
#define RP2040_PIO_SM3_INSTR_OFFSET          0x000120                /* Instruction currently being executed by state machine 3 Write to execute an instruction immediately (including jumps) and then resume execution. */
#define RP2040_PIO_SM3_PINCTRL_OFFSET        0x000124                /* State machine pin control */
#define RP2040_PIO_INTR_OFFSET               0x000128                /* Raw Interrupts */
#define RP2040_PIO_IRQ0_INTE_OFFSET          0x00012c                /* Interrupt Enable for irq0 */
#define RP2040_PIO_IRQ0_INTF_OFFSET          0x000130                /* Interrupt Force for irq0 */
#define RP2040_PIO_IRQ0_INTS_OFFSET          0x000134                /* Interrupt status after masking & forcing for irq0 */
#define RP2040_PIO_IRQ1_INTE_OFFSET          0x000138                /* Interrupt Enable for irq1 */
#define RP2040_PIO_IRQ1_INTF_OFFSET          0x00013c                /* Interrupt Force for irq1 */
#define RP2040_PIO_IRQ1_INTS_OFFSET          0x000140                /* Interrupt status after masking & forcing for irq1 */

/* Register definitions *****************************************************/

#define RP2040_PIO_CTRL(n)               (RP2040_PIO_BASE(n) + RP2040_PIO_CTRL_OFFSET)
#define RP2040_PIO_FSTAT(n)              (RP2040_PIO_BASE(n) + RP2040_PIO_FSTAT_OFFSET)
#define RP2040_PIO_FDEBUG(n)             (RP2040_PIO_BASE(n) + RP2040_PIO_FDEBUG_OFFSET)
#define RP2040_PIO_FLEVEL(n)             (RP2040_PIO_BASE(n) + RP2040_PIO_FLEVEL_OFFSET)
#define RP2040_PIO_TXF(n, m)             (RP2040_PIO_BASE(n) + RP2040_PIO_TXF_OFFSET(m))
#define RP2040_PIO_TXF0(n)               (RP2040_PIO_BASE(n) + RP2040_PIO_TXF0_OFFSET)
#define RP2040_PIO_TXF1(n)               (RP2040_PIO_BASE(n) + RP2040_PIO_TXF1_OFFSET)
#define RP2040_PIO_TXF2(n)               (RP2040_PIO_BASE(n) + RP2040_PIO_TXF2_OFFSET)
#define RP2040_PIO_TXF3(n)               (RP2040_PIO_BASE(n) + RP2040_PIO_TXF3_OFFSET)
#define RP2040_PIO_RXF(n, m)             (RP2040_PIO_BASE(n) + RP2040_PIO_RXF_OFFSET(m))
#define RP2040_PIO_RXF0(n)               (RP2040_PIO_BASE(n) + RP2040_PIO_RXF0_OFFSET)
#define RP2040_PIO_RXF1(n)               (RP2040_PIO_BASE(n) + RP2040_PIO_RXF1_OFFSET)
#define RP2040_PIO_RXF2(n)               (RP2040_PIO_BASE(n) + RP2040_PIO_RXF2_OFFSET)
#define RP2040_PIO_RXF3(n)               (RP2040_PIO_BASE(n) + RP2040_PIO_RXF3_OFFSET)
#define RP2040_PIO_IRQ(n)                (RP2040_PIO_BASE(n) + RP2040_PIO_IRQ_OFFSET)
#define RP2040_PIO_IRQ_FORCE(n)          (RP2040_PIO_BASE(n) + RP2040_PIO_IRQ_FORCE_OFFSET)
#define RP2040_PIO_INPUT_SYNC_BYPASS(n)  (RP2040_PIO_BASE(n) + RP2040_PIO_INPUT_SYNC_BYPASS_OFFSET)
#define RP2040_PIO_DBG_PADOUT(n)         (RP2040_PIO_BASE(n) + RP2040_PIO_DBG_PADOUT_OFFSET)
#define RP2040_PIO_DBG_PADOE(n)          (RP2040_PIO_BASE(n) + RP2040_PIO_DBG_PADOE_OFFSET)
#define RP2040_PIO_DBG_CFGINFO(n)        (RP2040_PIO_BASE(n) + RP2040_PIO_DBG_CFGINFO_OFFSET)
#define RP2040_PIO_INSTR_MEM(n, m)       (RP2040_PIO_BASE(n) + RP2040_PIO_INSTR_MEM_OFFSET(m))

#define RP2040_PIO_SM_CLKDIV(n, m)       (RP2040_PIO_BASE(n) + RP2040_PIO_SM_CLKDIV_OFFSET(m))
#define RP2040_PIO_SM_EXECCTRL(n, m)     (RP2040_PIO_BASE(n) + RP2040_PIO_SM_EXECCTRL_OFFSET(m))
#define RP2040_PIO_SM_SHIFTCTRL(n, m)    (RP2040_PIO_BASE(n) + RP2040_PIO_SM_SHIFTCTRL_OFFSET(m))
#define RP2040_PIO_SM_ADDR(n, m)         (RP2040_PIO_BASE(n) + RP2040_PIO_SM_ADDR_OFFSET(m))
#define RP2040_PIO_SM_INSTR(n, m)        (RP2040_PIO_BASE(n) + RP2040_PIO_SM_INSTR_OFFSET(m))
#define RP2040_PIO_SM_PINCTRL(n, m)      (RP2040_PIO_BASE(n) + RP2040_PIO_SM_PINCTRL_OFFSET(m))

#define RP2040_PIO_SM0_CLKDIV(n)         (RP2040_PIO_BASE(n) + RP2040_PIO_SM0_CLKDIV_OFFSET)
#define RP2040_PIO_SM0_EXECCTRL(n)       (RP2040_PIO_BASE(n) + RP2040_PIO_SM0_EXECCTRL_OFFSET)
#define RP2040_PIO_SM0_SHIFTCTRL(n)      (RP2040_PIO_BASE(n) + RP2040_PIO_SM0_SHIFTCTRL_OFFSET)
#define RP2040_PIO_SM0_ADDR(n)           (RP2040_PIO_BASE(n) + RP2040_PIO_SM0_ADDR_OFFSET)
#define RP2040_PIO_SM0_INSTR(n)          (RP2040_PIO_BASE(n) + RP2040_PIO_SM0_INSTR_OFFSET)
#define RP2040_PIO_SM0_PINCTRL(n)        (RP2040_PIO_BASE(n) + RP2040_PIO_SM0_PINCTRL_OFFSET)
#define RP2040_PIO_SM1_CLKDIV(n)         (RP2040_PIO_BASE(n) + RP2040_PIO_SM1_CLKDIV_OFFSET)
#define RP2040_PIO_SM1_EXECCTRL(n)       (RP2040_PIO_BASE(n) + RP2040_PIO_SM1_EXECCTRL_OFFSET)
#define RP2040_PIO_SM1_SHIFTCTRL(n)      (RP2040_PIO_BASE(n) + RP2040_PIO_SM1_SHIFTCTRL_OFFSET)
#define RP2040_PIO_SM1_ADDR(n)           (RP2040_PIO_BASE(n) + RP2040_PIO_SM1_ADDR_OFFSET)
#define RP2040_PIO_SM1_INSTR(n)          (RP2040_PIO_BASE(n) + RP2040_PIO_SM1_INSTR_OFFSET)
#define RP2040_PIO_SM1_PINCTRL(n)        (RP2040_PIO_BASE(n) + RP2040_PIO_SM1_PINCTRL_OFFSET)
#define RP2040_PIO_SM2_CLKDIV(n)         (RP2040_PIO_BASE(n) + RP2040_PIO_SM2_CLKDIV_OFFSET)
#define RP2040_PIO_SM2_EXECCTRL(n)       (RP2040_PIO_BASE(n) + RP2040_PIO_SM2_EXECCTRL_OFFSET)
#define RP2040_PIO_SM2_SHIFTCTRL(n)      (RP2040_PIO_BASE(n) + RP2040_PIO_SM2_SHIFTCTRL_OFFSET)
#define RP2040_PIO_SM2_ADDR(n)           (RP2040_PIO_BASE(n) + RP2040_PIO_SM2_ADDR_OFFSET)
#define RP2040_PIO_SM2_INSTR(n)          (RP2040_PIO_BASE(n) + RP2040_PIO_SM2_INSTR_OFFSET)
#define RP2040_PIO_SM2_PINCTRL(n)        (RP2040_PIO_BASE(n) + RP2040_PIO_SM2_PINCTRL_OFFSET)
#define RP2040_PIO_SM3_CLKDIV(n)         (RP2040_PIO_BASE(n) + RP2040_PIO_SM3_CLKDIV_OFFSET)
#define RP2040_PIO_SM3_EXECCTRL(n)       (RP2040_PIO_BASE(n) + RP2040_PIO_SM3_EXECCTRL_OFFSET)
#define RP2040_PIO_SM3_SHIFTCTRL(n)      (RP2040_PIO_BASE(n) + RP2040_PIO_SM3_SHIFTCTRL_OFFSET)
#define RP2040_PIO_SM3_ADDR(n)           (RP2040_PIO_BASE(n) + RP2040_PIO_SM3_ADDR_OFFSET)
#define RP2040_PIO_SM3_INSTR(n)          (RP2040_PIO_BASE(n) + RP2040_PIO_SM3_INSTR_OFFSET)
#define RP2040_PIO_SM3_PINCTRL(n)        (RP2040_PIO_BASE(n) + RP2040_PIO_SM3_PINCTRL_OFFSET)
#define RP2040_PIO_INTR(n)               (RP2040_PIO_BASE(n) + RP2040_PIO_INTR_OFFSET)
#define RP2040_PIO_IRQ0_INTE(n)          (RP2040_PIO_BASE(n) + RP2040_PIO_IRQ0_INTE_OFFSET)
#define RP2040_PIO_IRQ0_INTF(n)          (RP2040_PIO_BASE(n) + RP2040_PIO_IRQ0_INTF_OFFSET)
#define RP2040_PIO_IRQ0_INTS(n)          (RP2040_PIO_BASE(n) + RP2040_PIO_IRQ0_INTS_OFFSET)
#define RP2040_PIO_IRQ1_INTE(n)          (RP2040_PIO_BASE(n) + RP2040_PIO_IRQ1_INTE_OFFSET)
#define RP2040_PIO_IRQ1_INTF(n)          (RP2040_PIO_BASE(n) + RP2040_PIO_IRQ1_INTF_OFFSET)
#define RP2040_PIO_IRQ1_INTS(n)          (RP2040_PIO_BASE(n) + RP2040_PIO_IRQ1_INTS_OFFSET)

/* Register bit definitions *************************************************/

#define RP2040_PIO_CTRL_CLKDIV_RESTART_SHIFT        (8)     /* Force clock dividers to restart their count and clear fractional accumulators. Restart multiple dividers to synchronise them. */
#define RP2040_PIO_CTRL_CLKDIV_RESTART_MASK         (0x0f << RP2040_PIO_CTRL_CLKDIV_RESTART_SHIFT)
#define RP2040_PIO_CTRL_SM_RESTART_SHIFT            (4)     /* Clear internal SM state which is otherwise difficult to access (e.g. shift counters). Self-clearing. */
#define RP2040_PIO_CTRL_SM_RESTART_MASK             (0x0f << RP2040_PIO_CTRL_SM_RESTART_SHIFT)
#define RP2040_PIO_CTRL_SM_ENABLE_MASK              (0x0f)  /* Enable state machine */

