mdepx/mdepx/arch/arm/raspberrypi/rp2040_pio_regs.h
#define RP2040_PIO_FSTAT_TXEMPTY_SHIFT              (24)    /* State machine TX FIFO is empty */
#define RP2040_PIO_FSTAT_TXEMPTY_MASK               (0x0f << RP2040_PIO_FSTAT_TXEMPTY_SHIFT)
#define RP2040_PIO_FSTAT_TXFULL_SHIFT               (16)    /* State machine TX FIFO is full */
#define RP2040_PIO_FSTAT_TXFULL_MASK                (0x0f << RP2040_PIO_FSTAT_TXFULL_SHIFT)
#define RP2040_PIO_FSTAT_RXEMPTY_SHIFT              (8)     /* State machine RX FIFO is empty */
#define RP2040_PIO_FSTAT_RXEMPTY_MASK               (0x0f << RP2040_PIO_FSTAT_RXEMPTY_SHIFT)
#define RP2040_PIO_FSTAT_RXFULL_SHIFT               (0)     /* State machine RX FIFO is full */
#define RP2040_PIO_FSTAT_RXFULL_MASK                (0x0f)  /* State machine RX FIFO is full */

#define RP2040_PIO_FDEBUG_TXSTALL_SHIFT             (24)    /* State machine has stalled on empty TX FIFO. Write 1 to clear. */
#define RP2040_PIO_FDEBUG_TXSTALL_MASK              (0x0f << RP2040_PIO_FDEBUG_TXSTALL_SHIFT)
#define RP2040_PIO_FDEBUG_TXOVER_SHIFT              (16)    /* TX FIFO overflow has occurred. Write 1 to clear. */
#define RP2040_PIO_FDEBUG_TXOVER_MASK               (0x0f << RP2040_PIO_FDEBUG_TXOVER_SHIFT)
#define RP2040_PIO_FDEBUG_RXUNDER_SHIFT             (8)     /* RX FIFO underflow has occurred. Write 1 to clear. */
#define RP2040_PIO_FDEBUG_RXUNDER_MASK              (0x0f << RP2040_PIO_FDEBUG_RXUNDER_SHIFT)
#define RP2040_PIO_FDEBUG_RXSTALL_SHIFT             (0)     /* State machine has stalled on full RX FIFO. Write 1 to clear. */
#define RP2040_PIO_FDEBUG_RXSTALL_MASK              (0x0f)  /* State machine has stalled on full RX FIFO. Write 1 to clear. */

#define RP2040_PIO_FLEVEL_RX3_SHIFT                 (28)
#define RP2040_PIO_FLEVEL_RX3_MASK                  (0x0f << RP2040_PIO_FLEVEL_RX3_SHIFT)
#define RP2040_PIO_FLEVEL_TX3_SHIFT                 (24)
#define RP2040_PIO_FLEVEL_TX3_MASK                  (0x0f << RP2040_PIO_FLEVEL_TX3_SHIFT)
#define RP2040_PIO_FLEVEL_RX2_SHIFT                 (20)
#define RP2040_PIO_FLEVEL_RX2_MASK                  (0x0f << RP2040_PIO_FLEVEL_RX2_SHIFT)
#define RP2040_PIO_FLEVEL_TX2_SHIFT                 (16)
#define RP2040_PIO_FLEVEL_TX2_MASK                  (0x0f << RP2040_PIO_FLEVEL_TX2_SHIFT)
#define RP2040_PIO_FLEVEL_RX1_SHIFT                 (12)
#define RP2040_PIO_FLEVEL_RX1_MASK                  (0x0f << RP2040_PIO_FLEVEL_RX1_SHIFT)
#define RP2040_PIO_FLEVEL_TX1_SHIFT                 (8)
#define RP2040_PIO_FLEVEL_TX1_MASK                  (0x0f << RP2040_PIO_FLEVEL_TX1_SHIFT)
#define RP2040_PIO_FLEVEL_RX0_SHIFT                 (4)
#define RP2040_PIO_FLEVEL_RX0_MASK                  (0x0f << RP2040_PIO_FLEVEL_RX0_SHIFT)
#define RP2040_PIO_FLEVEL_TX0_SHIFT                 (0)
#define RP2040_PIO_FLEVEL_TX0_MASK                  (0x0f)

#define RP2040_PIO_FLEVEL_TX_MASK(n)                (0x0f << 8*n)
#define RP2040_PIO_FLEVEL_RX_MASK(n)                (0xf0 << 8*n)

#define RP2040_PIO_IRQ_MASK                         (0xff)

#define RP2040_PIO_IRQ_FORCE_MASK                   (0xff)

#define RP2040_PIO_DBG_CFGINFO_IMEM_SIZE_SHIFT      (16)    /* The size of the instruction memory, measured in units of one instruction */
#define RP2040_PIO_DBG_CFGINFO_IMEM_SIZE_MASK       (0x3f << RP2040_PIO_DBG_CFGINFO_IMEM_SIZE_SHIFT)
#define RP2040_PIO_DBG_CFGINFO_SM_COUNT_SHIFT       (8)     /* The number of state machines this PIO instance is equipped with. */
#define RP2040_PIO_DBG_CFGINFO_SM_COUNT_MASK        (0x0f << RP2040_PIO_DBG_CFGINFO_SM_COUNT_SHIFT)
#define RP2040_PIO_DBG_CFGINFO_FIFO_DEPTH_MASK      (0x3f)  /* The depth of the state machine TX/RX FIFOs, measured in words. Joining fifos via SHIFTCTRL_FJOIN gives one FIFO with double this depth. */

#define RP2040_PIO_INSTR_MEM_MASK                   (0xffff)

#define RP2040_PIO_SM_CLKDIV_INT_SHIFT             (16)  /* Effective frequency is sysclk/int. Value of 0 is interpreted as max possible value */
#define RP2040_PIO_SM_CLKDIV_INT_MASK              (0xffff << RP2040_PIO_SM_CLKDIV_INT_SHIFT)
#define RP2040_PIO_SM_CLKDIV_FRAC_SHIFT            (8)   /* Fractional part of clock divider */
#define RP2040_PIO_SM_CLKDIV_FRAC_MASK             (0xff << RP2040_PIO_SM_CLKDIV_FRAC_SHIFT)

#define RP2040_PIO_SM_EXECCTRL_EXEC_STALLED        (1 << 31)  /* An instruction written to SMx_INSTR is stalled, and latched by the state machine. Will clear once the instruction completes. */
#define RP2040_PIO_SM_EXECCTRL_SIDE_EN             (1 << 30)  /* If 1, the delay MSB is used as side-set enable, rather than a side-set data bit. This allows instructions to perform side-set optionally, rather than on every instruction. */
#define RP2040_PIO_SM_EXECCTRL_SIDE_PINDIR         (1 << 29)  /* Side-set data is asserted to pin OEs instead of pin values */
#define RP2040_PIO_SM_EXECCTRL_JMP_PIN_SHIFT       (24)       /* The GPIO number to use as condition for JMP PIN. Unaffected by input mapping. */
#define RP2040_PIO_SM_EXECCTRL_JMP_PIN_MASK        (0x1f << RP2040_PIO_SM_EXECCTRL_JMP_PIN_SHIFT)
#define RP2040_PIO_SM_EXECCTRL_OUT_EN_SEL_SHIFT    (19)       /* Which data bit to use for inline OUT enable */
#define RP2040_PIO_SM_EXECCTRL_OUT_EN_SEL_MASK     (0x1f << RP2040_PIO_SM_EXECCTRL_OUT_EN_SEL_SHIFT)
#define RP2040_PIO_SM_EXECCTRL_INLINE_OUT_EN       (1 << 18)  /* If 1, use a bit of OUT data as an auxiliary write enable When used in conjunction with OUT_STICKY, writes with an enable of 0 will deassert the latest pin write. This can create useful masking/override behaviour due to the priority ordering of state machine pin writes (SM0 < SM1 < ...) */
#define RP2040_PIO_SM_EXECCTRL_OUT_STICKY          (1 << 17)  /* Continuously assert the most recent OUT/SET to the pins */
#define RP2040_PIO_SM_EXECCTRL_WRAP_TOP_SHIFT      (12)       /* After reaching this address, execution is wrapped to wrap_bottom. If the instruction is a jump, and the jump condition is true, the jump takes priority. */
#define RP2040_PIO_SM_EXECCTRL_WRAP_TOP_MASK       (0x1f << RP2040_PIO_SM_EXECCTRL_WRAP_TOP_SHIFT)
#define RP2040_PIO_SM_EXECCTRL_WRAP_BOTTOM_SHIFT   (7)        /* After reaching wrap_top, execution is wrapped to this address. */
#define RP2040_PIO_SM_EXECCTRL_WRAP_BOTTOM_MASK    (0x1f << RP2040_PIO_SM_EXECCTRL_WRAP_BOTTOM_SHIFT)
#define RP2040_PIO_SM_EXECCTRL_STATUS_SEL          (1 << 4)   /* All-ones if RX FIFO level < N, otherwise all-zeroes */
#define RP2040_PIO_SM_EXECCTRL_STATUS_N_MASK       (0x0f)     /* Comparison level for the MOV x, STATUS instruction */

#define RP2040_PIO_SM_SHIFTCTRL_FJOIN_RX           (1 << 31)  /* When 1, RX FIFO steals the TX FIFO's storage, and becomes twice as deep. TX FIFO is disabled as a result (always reads as both full and empty). FIFOs are flushed when this bit is changed. */
#define RP2040_PIO_SM_SHIFTCTRL_FJOIN_TX           (1 << 30)  /* When 1, TX FIFO steals the RX FIFO's storage, and becomes twice as deep. RX FIFO is disabled as a result (always reads as both full and empty). FIFOs are flushed when this bit is changed. */
#define RP2040_PIO_SM_SHIFTCTRL_PULL_THRESH_SHIFT  (25)       /* Number of bits shifted out of TXSR before autopull or conditional pull. Write 0 for value of 32. */
#define RP2040_PIO_SM_SHIFTCTRL_PULL_THRESH_MASK   (0x1f << RP2040_PIO_SM_SHIFTCTRL_PULL_THRESH_SHIFT)
#define RP2040_PIO_SM_SHIFTCTRL_PUSH_THRESH_SHIFT  (20)       /* Number of bits shifted into RXSR before autopush or conditional push. Write 0 for value of 32. */
#define RP2040_PIO_SM_SHIFTCTRL_PUSH_THRESH_MASK   (0x1f << RP2040_PIO_SM_SHIFTCTRL_PUSH_THRESH_SHIFT)
#define RP2040_PIO_SM_SHIFTCTRL_OUT_SHIFTDIR       (1 << 19)  /* 1 = shift out of output shift register to right. 0 = to left. */
#define RP2040_PIO_SM_SHIFTCTRL_IN_SHIFTDIR        (1 << 18)  /* 1 = shift input shift register to right (data enters from left). 0 = to left. */
#define RP2040_PIO_SM_SHIFTCTRL_AUTOPULL           (1 << 17)  /* Pull automatically when the output shift register is emptied */
#define RP2040_PIO_SM_SHIFTCTRL_AUTOPUSH           (1 << 16)  /* Push automatically when the input shift register is filled */

#define RP2040_PIO_SM_ADDR_MASK                    (0x1f)

#define RP2040_PIO_SM_INSTR_MASK                   (0xffff)

