mdepx/mdepx/arch/arm/raspberrypi/rp2040_pio_regs.h
#define RP2040_PIO_SM_PINCTRL_SIDESET_COUNT_SHIFT  (29)    /* The number of delay bits co-opted for side-set. Inclusive of the enable bit, if present. */
#define RP2040_PIO_SM_PINCTRL_SIDESET_COUNT_MASK   (0x07 << RP2040_PIO_SM_PINCTRL_SIDESET_COUNT_SHIFT)
#define RP2040_PIO_SM_PINCTRL_SET_COUNT_SHIFT      (26)    /* The number of pins asserted by a SET. Max of 5 */
#define RP2040_PIO_SM_PINCTRL_SET_COUNT_MASK       (0x07 << RP2040_PIO_SM_PINCTRL_SET_COUNT_SHIFT)
#define RP2040_PIO_SM_PINCTRL_OUT_COUNT_SHIFT      (20)    /* The number of pins asserted by an OUT. Value of 0 -> 32 pins */
#define RP2040_PIO_SM_PINCTRL_OUT_COUNT_MASK       (0x3f << RP2040_PIO_SM_PINCTRL_OUT_COUNT_SHIFT)
#define RP2040_PIO_SM_PINCTRL_IN_BASE_SHIFT        (15)    /* The virtual pin corresponding to IN bit 0 */
#define RP2040_PIO_SM_PINCTRL_IN_BASE_MASK         (0x1f << RP2040_PIO_SM_PINCTRL_IN_BASE_SHIFT)
#define RP2040_PIO_SM_PINCTRL_SIDESET_BASE_SHIFT   (10)    /* The virtual pin corresponding to delay field bit 0 */
#define RP2040_PIO_SM_PINCTRL_SIDESET_BASE_MASK    (0x1f << RP2040_PIO_SM_PINCTRL_SIDESET_BASE_SHIFT)
#define RP2040_PIO_SM_PINCTRL_SET_BASE_SHIFT       (5)     /* The virtual pin corresponding to SET bit 0 */
#define RP2040_PIO_SM_PINCTRL_SET_BASE_MASK        (0x1f << RP2040_PIO_SM_PINCTRL_SET_BASE_SHIFT)
#define RP2040_PIO_SM_PINCTRL_OUT_BASE_SHIFT       (0)     /* The virtual pin corresponding to OUT bit 0 */
#define RP2040_PIO_SM_PINCTRL_OUT_BASE_MASK        (0x1f)  /* The virtual pin corresponding to OUT bit 0 */

#define RP2040_PIO_INTR_SM3                         (1 << 11)
#define RP2040_PIO_INTR_SM2                         (1 << 10)
#define RP2040_PIO_INTR_SM1                         (1 << 9)
#define RP2040_PIO_INTR_SM0                         (1 << 8)
#define RP2040_PIO_INTR_SM3_TXNFULL                 (1 << 7)
#define RP2040_PIO_INTR_SM2_TXNFULL                 (1 << 6)
#define RP2040_PIO_INTR_SM1_TXNFULL                 (1 << 5)
#define RP2040_PIO_INTR_SM0_TXNFULL                 (1 << 4)
#define RP2040_PIO_INTR_SM3_RXNEMPTY                (1 << 3)
#define RP2040_PIO_INTR_SM2_RXNEMPTY                (1 << 2)
#define RP2040_PIO_INTR_SM1_RXNEMPTY                (1 << 1)
#define RP2040_PIO_INTR_SM0_RXNEMPTY                (1 << 0)

#endif /* _ARCH_ARM_RASPBERRYPI_RP2040_PIOREGS_H_ */
